In [2]:
import pandas as pd
import numpy as np

In [3]:
# a - Map -- applies a fucntion on a series of data

In [4]:
s = pd.Series(['cat','dog',np.nan,'rabbit'])

In [5]:
s

0       cat
1       dog
2       NaN
3    rabbit
dtype: object

In [6]:
s.map({'cat':'kitten', 'dog':'puppy'})

0    kitten
1     puppy
2       NaN
3       NaN
dtype: object

In [7]:
s.map('I am a {}'.format,na_action='ignore')

0       I am a cat
1       I am a dog
2              NaN
3    I am a rabbit
dtype: object

In [8]:
#b - Apply -- applies a fucntion on a selected axis

In [9]:
s = pd.Series([20,21,22],index=['London','New York','Helsinki'])

In [10]:
s.apply(lambda x: x**2)

London      400
New York    441
Helsinki    484
dtype: int64

In [11]:
df = pd.DataFrame(np.random.randint(10,size=(5,2)),columns=range(2),index=range(5))

In [12]:
df.apply(lambda x:x**2)

    0   1
0  49  36
1   0   9
2   4  25
3   1  25
4  64   4

In [13]:
df

   0  1
0  7  6
1  0  3
2  2  5
3  1  5
4  8  2

In [14]:
# c applymap -- applies a fcuntion eleemnt by element
df.applymap(lambda x:x*8)

    0   1
0  56  48
1   0  24
2  16  40
3   8  40
4  64  16